src/cf/InformationRegisters/ИдентификаторыПисемДляОтложеннойПривязки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИдентификаторыПисемДляОтложеннойПривязки</Name>
			<Comment>Используется для отложенного связывания писем по мере загрузки</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Comment>SHA256 от идентификатора сообщения (Message-ID)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоОснование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ИдентификаторыПисемДляОтложеннойПривязки/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Записывает идентификатор, по которому не удалось найти Событие в момент загрузки письма.
//
// Параметры:
//  УчетнаяЗапись			 - СправочникСсылка.УчетныеЗаписиЭлектроннойПочты - учетная запись,
//  ИдентификаторСообщения	 - Строка - идентификатор сообщения (Message-ID), которое должно быть привязано к Событию в момент загрузки,
//  ЭтоОснование			 - Булево - признак того, что загруженное сообщение должно быть в реквизите ДокументОснование,
//  Событие					 - ДокументСсылка.Событие - событие, к которому будет привязано письмо с указанным идентификатором.
//
Процедура ЗаписатьИдентификаторСообщения(Знач УчетнаяЗапись, Знач ИдентификаторСообщения, Знач ЭтоОснование, Знач Событие) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.УчетнаяЗапись = УчетнаяЗапись;
	МенеджерЗаписи.Ключ = ОбменСGoogle.КлючИзИдентификатора(ИдентификаторСообщения,
	"РС.ИдентификаторыПисемДляОтложеннойПривязки.Записать()");
	МенеджерЗаписи.ЭтоОснование = ЭтоОснование;
	МенеджерЗаписи.Событие = Событие;
	МенеджерЗаписи.ИдентификаторСообщения = ИдентификаторСообщения;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Возвращает события, предназначенные для отложенной привязки.
//
// Параметры:
//  УчетнаяЗапись			 - СправочникСсылка.УчетныеЗаписиЭлектроннойПочты - учетная запись,
//  ИдентификаторСообщения	 - Строка - идентификатор привязанного сообщения (Message-ID).
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица с привязанными событиями.
//
Функция СвязанныеСобытия(Знач УчетнаяЗапись, Знач ИдентификаторСообщения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ИдентификаторыПисемДляОтложеннойПривязки.Событие,
	|	ИдентификаторыПисемДляОтложеннойПривязки.ЭтоОснование
	|ИЗ
	|	РегистрСведений.ИдентификаторыПисемДляОтложеннойПривязки КАК ИдентификаторыПисемДляОтложеннойПривязки
	|ГДЕ
	|	ИдентификаторыПисемДляОтложеннойПривязки.УчетнаяЗапись = &УчетнаяЗапись
	|	И ИдентификаторыПисемДляОтложеннойПривязки.Ключ = &Ключ");
	Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
	Запрос.УстановитьПараметр("Ключ", ОбменСGoogle.КлючИзИдентификатора(ИдентификаторСообщения,
	"РС.ИдентификаторыПисемДляОтложеннойПривязки.СвязанныеСобытия()"));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Удаляет идентификатор сообщения из регистра после отложенной привязки.
//
// Параметры:
//  УчетнаяЗапись  - СправочникСсылка.УчетныеЗаписиЭлектроннойПочты - учетная запись,
//  ИдентификаторСообщения - Строка - идентификатор привязанного сообщения (Message-ID).
//
Процедура УдалитьИдентификаторСообщения(Знач УчетнаяЗапись, Знач ИдентификаторСообщения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.УчетнаяЗапись.Установить(УчетнаяЗапись);
	НаборЗаписей.Отбор.Ключ.Установить(ОбменСGoogle.КлючИзИдентификатора(ИдентификаторСообщения,
	"РС.ИдентификаторыПисемДляОтложеннойПривязки.Удалить()"));
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
